//C语言统计单词个数，单词个数算法
//在实际生活中经常会遇到一个问题：写英语作文时，常常要求满足一定的字数。在以往，要么我们一个一个地数；要么我们估算一行的单词数，然后用行数进行估算。
//第一种方法太费时，若是长篇大论，那几乎是不可能统计的；而第二种方法不太准确。这就给我们留下了一个问题：如何又快、又准确地统计一篇英文文章中的单词数？
//算法思想
//要解决这个问题，最自然的算法是，读取文章的所有内容，然后一个单词一个单词地统计
//然而，我们在这里遇到了一个难题：程序看不懂英文，如何知道什么是一个单词，什么不是一个单词呢？
//似乎在这里遇到了障碍，可是，如果换个角度思考问题，也许会柳暗花明又一村：文章中的单词都是用空格间隔开的，换句话说，单词数=空格数+1。
//程序不认识单词，但是程序认识空格,这样，整个问题实际上转换成了统计文章中的空格数。


#include <stdio.h>
int main()
{
    printf("输入一行字符：\n");
    char ch;
    int i,count=0,word=0;
    while((ch=getchar())!='\n')
        if(ch==' ')
            word=0;
        else if(word==0)
        {
            word=1;
            count++;
        }
    printf("总共有 %d 个单词\n",count);
    return 0;
}
