//冒泡降序
//冒泡排序算法的运作如下：（从后往前）
//1.比较相邻的元素。如果第一个比第二个大，就交换他们两个。
//2.对每一对相邻元素作同样的工作，从开始第一对到结尾的最后一对。在这一点，最后的元素应该会是最大的数。
//3.针对所有的元素重复以上的步骤，除了最后一个。
//4.持续每次对越来越少的元素重复上面的步骤，直到没有任何一对数字需要比较。

#include "stdafx.h"

int main(int argc, char* argv[])
{
	int a[10],i,j,tmp;
	printf("enter 10 numbers:");
	for(i=0;i<10;i++)
		scanf("%d",&a[i]);
	for(i=0;i<9;i++)//外部循环 
		for(j=9;j>i;j--)//内部循环 
		{
			if(a[j]>a[j-1])//比较两个元素的大小 
			//如果前一个大，则交换 
			{
				tmp=a[j];
				a[j]=a[j-1];
				a[j-1]=tmp;
			}
		}
		for(i=0;i<10;i++)
			printf("%d ",a[i]);

	return 0;
}
